<?php
$data = array(
//zero value
		'nul' => 'ноль',
		//form 1-9
		'ten' =>
		array(
				array('','одна','дві','три','чотири','п\'ять','шість','сім', 'вісім','дев\'ять'),
				array('','одна','дві','три','чотири','п\'ять','шість','сім', 'вісім','дев\'ять'),
		),
		//from 10-19
		'a20' =>
		array('десять','одинадцять','дванадцять','тринадцять','чотирнадцять' ,'п\'ятнадцять','шістнадцять','сімнадцять','вісімнадцять','дев\'ятнадцять'),
		//from 20-90
		'tens' =>
		array(2=>'двадцять','тридцять','сорок','п\'ятдесят','шістдесят','сімдесят' ,'вісімдесят','дев\'яносто'),
		//from 100-900
		'hundred' =>
		array('','сто','двісті','триста','чотириста','п\'ятсот','шістсот', 'сімсот','вісімсот','дев\'ятсот'),
		//units
		'unit' =>
		array( // Units
				array('копійка' ,'копійки' ,'копійок',	 1),
				array('гривня', 'гривні', 'гривень'    ,0),
				array('тисяча' ,'тисячі' ,'тисяч'     ,1),
				array('мільйон' ,'мільйона','мільйонів' ,0),
				array('мільярд', 'міліарда', 'мільярдів',0),
		)
);